MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31D0AGN20000/mcu.h
/*******************************************************************************
* HDMICEC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t TXCTRL;
        stc_hdmicec_txctrl_field_t TXCTRL_f;
    };
        __IO  uint8_t RESERVED0[3];
    union {
        __IO  uint8_t TXDATA;
        stc_hdmicec_txdata_field_t TXDATA_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t TXSTS;
        stc_hdmicec_txsts_field_t TXSTS_f;
    };
        __IO  uint8_t RESERVED2[3];
    union {
        __IO  uint8_t SFREE;
        stc_hdmicec_sfree_field_t SFREE_f;
    };
        __IO  uint8_t RESERVED3[51];
    union {
        __IO  uint8_t RCST;
        stc_hdmicec_rcst_field_t RCST_f;
    };
    union {
        __IO  uint8_t RCCR;
        stc_hdmicec_rccr_field_t RCCR_f;
    };
        __IO  uint8_t RESERVED4[2];
    union {
        __IO  uint8_t RCDAHW;
        stc_hdmicec_rcdahw_field_t RCDAHW_f;
    };
    union {
        __IO  uint8_t RCSHW;
        stc_hdmicec_rcshw_field_t RCSHW_f;
    };
        __IO  uint8_t RESERVED5[3];
    union {
        __IO  uint8_t RCDBHW;
        stc_hdmicec_rcdbhw_field_t RCDBHW_f;
    };
        __IO  uint8_t RESERVED6[2];
    union {
        __IO  uint8_t RCADR2;
        stc_hdmicec_rcadr2_field_t RCADR2_f;
    };
    union {
        __IO  uint8_t RCADR1;
        stc_hdmicec_rcadr1_field_t RCADR1_f;
    };
        __IO  uint8_t RESERVED7[2];
    union {
        __IO  uint8_t RCDTHL;
        stc_hdmicec_rcdthl_field_t RCDTHL_f;
    };
    union {
        __IO  uint8_t RCDTHH;
        stc_hdmicec_rcdthh_field_t RCDTHH_f;
    };
        __IO  uint8_t RESERVED8[2];
    union {
        __IO  uint8_t RCDTLL;
        stc_hdmicec_rcdtll_field_t RCDTLL_f;
    };
    union {
        __IO  uint8_t RCDTLH;
        stc_hdmicec_rcdtlh_field_t RCDTLH_f;
    };
        __IO  uint8_t RESERVED9[2];
    union {
        __IO uint16_t RCCKD;
        stc_hdmicec_rcckd_field_t RCCKD_f;
        struct {
            __IO  uint8_t RCCKDL;
            __IO  uint8_t RCCKDH;
        };
    };
        __IO  uint8_t RESERVED10[2];
    union {
        __IO  uint8_t RCRHW;
        stc_hdmicec_rcrhw_field_t RCRHW_f;
    };
    union {
        __IO  uint8_t RCRC;
        stc_hdmicec_rcrc_field_t RCRC_f;
    };
        __IO  uint8_t RESERVED11[3];
    union {
        __IO  uint8_t RCLE;
        stc_hdmicec_rcle_field_t RCLE_f;
    };
        __IO  uint8_t RESERVED12[2];
    union {
        __IO  uint8_t RCLESW;
        stc_hdmicec_rclesw_field_t RCLESW_f;
    };
    union {
        __IO  uint8_t RCLELW;
        stc_hdmicec_rclelw_field_t RCLELW_f;
    };
} FM_HDMICEC_TypeDef, FM0P_HDMICEC_TypeDef;

/*******************************************************************************
* HWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDG_LDR;
        struct {
          union {
            __IO uint16_t WDG_LDRL;
            struct {
              __IO uint8_t WDG_LDRLL;
              __IO uint8_t WDG_LDRLH;
            };
          };
          union {
            __IO uint16_t WDG_LDRH;
            struct {
              __IO uint8_t WDG_LDRHL;
              __IO uint8_t WDG_LDRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_VLR;
        struct {
          union {
            __IO uint16_t WDG_VLRL;
            struct {
              __IO uint8_t WDG_VLRLL;
              __IO uint8_t WDG_VLRLH;
            };
          };
          union {
            __IO uint16_t WDG_VLRH;
            struct {
              __IO uint8_t WDG_VLRHL;
              __IO uint8_t WDG_VLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_CTL;
        stc_hwwdt_wdg_ctl_field_t WDG_CTL_f;
        struct {
          union {
            __IO uint16_t WDG_CTLL;
            struct {
              __IO uint8_t WDG_CTLLL;
              __IO uint8_t WDG_CTLLH;
            };
          };
          union {
            __IO uint16_t WDG_CTLH;
            struct {
              __IO uint8_t WDG_CTLHL;
              __IO uint8_t WDG_CTLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_ICL;
        struct {
          union {
            __IO uint16_t WDG_ICLL;
            struct {
              __IO uint8_t WDG_ICLLL;
              __IO uint8_t WDG_ICLLH;
            };
          };
          union {
            __IO uint16_t WDG_ICLH;
            struct {
              __IO uint8_t WDG_ICLHL;
              __IO uint8_t WDG_ICLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDG_RIS;
        stc_hwwdt_wdg_ris_field_t WDG_RIS_f;
        struct {
          union {
            __IO uint16_t WDG_RISL;
            struct {
              __IO uint8_t WDG_RISLL;
              __IO uint8_t WDG_RISLH;
            };
          };
          union {
            __IO uint16_t WDG_RISH;
            struct {
              __IO uint8_t WDG_RISHL;
              __IO uint8_t WDG_RISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[3052];
    union {
        __IO uint32_t WDG_LCK;
        struct {
          union {
            __IO uint16_t WDG_LCKL;
            struct {
              __IO uint8_t WDG_LCKLL;
              __IO uint8_t WDG_LCKLH;
            };
          };
          union {
            __IO uint16_t WDG_LCKH;
            struct {
              __IO uint8_t WDG_LCKHL;
              __IO uint8_t WDG_LCKHH;
            };
          };
        };
    };
} FM_HWWDT_TypeDef, FM0P_HWWDT_TypeDef;

/*******************************************************************************
* I2CSLAVE_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint16_t IBSSR;
        stc_i2cslave_ibssr_field_t IBSSR_f;
        struct {
            __IO  uint8_t IBSSRL;
            __IO  uint8_t IBSSRH;
        };
    };
    union {
        __IO uint16_t IBSCR;
        stc_i2cslave_ibscr_field_t IBSCR_f;
        struct {
            __IO  uint8_t IBSCRL;
            __IO  uint8_t IBSCRH;
        };
    };
    union {
        __IO  uint8_t IBSADR;
        stc_i2cslave_ibsadr_field_t IBSADR_f;
    };
    union {
        __IO  uint8_t IBSMSKR;
        stc_i2cslave_ibsmskr_field_t IBSMSKR_f;
    };
    union {
        __IO  uint8_t IBSDSTUPR;
        stc_i2cslave_ibsdstupr_field_t IBSDSTUPR_f;
    };
        __IO  uint8_t RESERVED0[1];
    union {
        __IO  uint8_t IBSTDR;
        stc_i2cslave_ibstdr_field_t IBSTDR_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t IBSRDR;
        stc_i2cslave_ibsrdr_field_t IBSRDR_f;
    };
        __IO  uint8_t RESERVED2[3];
    union {
        __IO uint16_t IBSSCR;
        stc_i2cslave_ibsscr_field_t IBSSCR_f;
        struct {
            __IO  uint8_t IBSSCRL;
            __IO  uint8_t IBSSCRH;
        };
    };
        __IO  uint8_t RESERVED3[2];
    union {
        __IO uint16_t IBSSSR;
        stc_i2cslave_ibsssr_field_t IBSSSR_f;
        struct {
            __IO  uint8_t IBSSSRL;
            __IO  uint8_t IBSSSRH;
        };
    };
} FM_I2CSLAVE_TypeDef, FM0P_I2CSLAVE_TypeDef;

