MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31D0AGN20000/mcu.h
#define bFM_CRG_SCM_STR_HCRDY                     *((volatile  uint32_t*)(0x42200080UL))
#define bFM0P_CRG_SCM_STR_HCRDY                   *((volatile  uint32_t*)(0x42200080UL))
#define bFM_CRG_SCM_STR_MORDY                     *((volatile  uint32_t*)(0x42200084UL))
#define bFM0P_CRG_SCM_STR_MORDY                   *((volatile  uint32_t*)(0x42200084UL))
#define bFM_CRG_SCM_STR_SORDY                     *((volatile  uint32_t*)(0x4220008CUL))
#define bFM0P_CRG_SCM_STR_SORDY                   *((volatile  uint32_t*)(0x4220008CUL))
#define bFM_CRG_SCM_STR_PLRDY                     *((volatile  uint32_t*)(0x42200090UL))
#define bFM0P_CRG_SCM_STR_PLRDY                   *((volatile  uint32_t*)(0x42200090UL))

#define bFM_CRG_STB_CTL_DSTM                      *((volatile  uint32_t*)(0x42200108UL))
#define bFM0P_CRG_STB_CTL_DSTM                    *((volatile  uint32_t*)(0x42200108UL))
#define bFM_CRG_STB_CTL_SPL                       *((volatile  uint32_t*)(0x42200110UL))
#define bFM0P_CRG_STB_CTL_SPL                     *((volatile  uint32_t*)(0x42200110UL))

#define bFM_CRG_SWC_PSR_TESTB                     *((volatile  uint32_t*)(0x4220041CUL))
#define bFM0P_CRG_SWC_PSR_TESTB                   *((volatile  uint32_t*)(0x4220041CUL))


/*******************************************************************************
* CRTRIM Registers CRTRIM
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* DS Registers DS
*   Bitband Section
*******************************************************************************/
#define bFM_DS_CAL_CTL_CALSTART                   *((volatile  uint8_t *)(0x426A4000UL))
#define bFM0P_DS_CAL_CTL_CALSTART                 *((volatile  uint8_t *)(0x426A4000UL))
#define bFM_DS_CAL_CTL_BGRSEL                     *((volatile  uint8_t *)(0x426A4008UL))
#define bFM0P_DS_CAL_CTL_BGRSEL                   *((volatile  uint8_t *)(0x426A4008UL))
#define bFM_DS_CAL_CTL_CALDONE                    *((volatile  uint8_t *)(0x426A400CUL))
#define bFM0P_DS_CAL_CTL_CALDONE                  *((volatile  uint8_t *)(0x426A400CUL))

#define bFM_DS_DEBUG_SW_CTL_DBG_EN                *((volatile  uint8_t *)(0x426B4180UL))
#define bFM0P_DS_DEBUG_SW_CTL_DBG_EN              *((volatile  uint8_t *)(0x426B4180UL))

#define bFM_DS_PMD_CTL_RTCE                       *((volatile  uint8_t *)(0x426B0000UL))
#define bFM0P_DS_PMD_CTL_RTCE                     *((volatile  uint8_t *)(0x426B0000UL))

#define bFM_DS_RCK_CTL_RTCCKE                     *((volatile  uint8_t *)(0x426A2080UL))
#define bFM0P_DS_RCK_CTL_RTCCKE                   *((volatile  uint8_t *)(0x426A2080UL))
#define bFM_DS_RCK_CTL_CECCKE                     *((volatile  uint8_t *)(0x426A2084UL))
#define bFM0P_DS_RCK_CTL_CECCKE                   *((volatile  uint8_t *)(0x426A2084UL))

#define bFM_DS_WIER_WRTCE                         *((volatile  uint8_t *)(0x426B0180UL))
#define bFM0P_DS_WIER_WRTCE                       *((volatile  uint8_t *)(0x426B0180UL))
#define bFM_DS_WIER_WLVDE                         *((volatile  uint8_t *)(0x426B0184UL))
#define bFM0P_DS_WIER_WLVDE                       *((volatile  uint8_t *)(0x426B0184UL))
#define bFM_DS_WIER_WUI1E                         *((volatile  uint8_t *)(0x426B018CUL))
#define bFM0P_DS_WIER_WUI1E                       *((volatile  uint8_t *)(0x426B018CUL))
#define bFM_DS_WIER_WUI2E                         *((volatile  uint8_t *)(0x426B0190UL))
#define bFM0P_DS_WIER_WUI2E                       *((volatile  uint8_t *)(0x426B0190UL))
#define bFM_DS_WIER_WUI3E                         *((volatile  uint8_t *)(0x426B0194UL))
#define bFM0P_DS_WIER_WUI3E                       *((volatile  uint8_t *)(0x426B0194UL))
#define bFM_DS_WIER_WUI4E                         *((volatile  uint8_t *)(0x426B0198UL))
#define bFM0P_DS_WIER_WUI4E                       *((volatile  uint8_t *)(0x426B0198UL))
#define bFM_DS_WIER_WUI5E                         *((volatile  uint8_t *)(0x426B019CUL))
#define bFM0P_DS_WIER_WUI5E                       *((volatile  uint8_t *)(0x426B019CUL))
#define bFM_DS_WIER_WCEC0E                        *((volatile  uint8_t *)(0x426B01A0UL))
#define bFM0P_DS_WIER_WCEC0E                      *((volatile  uint8_t *)(0x426B01A0UL))
#define bFM_DS_WIER_WCEC1E                        *((volatile  uint8_t *)(0x426B01A4UL))
#define bFM0P_DS_WIER_WCEC1E                      *((volatile  uint8_t *)(0x426B01A4UL))
#define bFM_DS_WIER_WUI6E                         *((volatile  uint8_t *)(0x426B01A8UL))
#define bFM0P_DS_WIER_WUI6E                       *((volatile  uint8_t *)(0x426B01A8UL))
#define bFM_DS_WIER_WUI7E                         *((volatile  uint8_t *)(0x426B01ACUL))
#define bFM0P_DS_WIER_WUI7E                       *((volatile  uint8_t *)(0x426B01ACUL))
#define bFM_DS_WIER_WUI8E                         *((volatile  uint8_t *)(0x426B01B0UL))
#define bFM0P_DS_WIER_WUI8E                       *((volatile  uint8_t *)(0x426B01B0UL))
#define bFM_DS_WIER_WUI9E                         *((volatile  uint8_t *)(0x426B01B4UL))
#define bFM0P_DS_WIER_WUI9E                       *((volatile  uint8_t *)(0x426B01B4UL))
#define bFM_DS_WIER_WUI10E                        *((volatile  uint8_t *)(0x426B01B8UL))
#define bFM0P_DS_WIER_WUI10E                      *((volatile  uint8_t *)(0x426B01B8UL))
#define bFM_DS_WIER_WUI11E                        *((volatile  uint8_t *)(0x426B01BCUL))
#define bFM0P_DS_WIER_WUI11E                      *((volatile  uint8_t *)(0x426B01BCUL))

#define bFM_DS_WIFSR_WRTCI                        *((volatile  uint8_t *)(0x426B0100UL))
#define bFM0P_DS_WIFSR_WRTCI                      *((volatile  uint8_t *)(0x426B0100UL))
#define bFM_DS_WIFSR_WLVDI                        *((volatile  uint8_t *)(0x426B0104UL))
#define bFM0P_DS_WIFSR_WLVDI                      *((volatile  uint8_t *)(0x426B0104UL))
#define bFM_DS_WIFSR_WUI0                         *((volatile  uint8_t *)(0x426B0108UL))
#define bFM0P_DS_WIFSR_WUI0                       *((volatile  uint8_t *)(0x426B0108UL))
#define bFM_DS_WIFSR_WUI1                         *((volatile  uint8_t *)(0x426B010CUL))
#define bFM0P_DS_WIFSR_WUI1                       *((volatile  uint8_t *)(0x426B010CUL))
#define bFM_DS_WIFSR_WUI2                         *((volatile  uint8_t *)(0x426B0110UL))
#define bFM0P_DS_WIFSR_WUI2                       *((volatile  uint8_t *)(0x426B0110UL))
#define bFM_DS_WIFSR_WUI3                         *((volatile  uint8_t *)(0x426B0114UL))
#define bFM0P_DS_WIFSR_WUI3                       *((volatile  uint8_t *)(0x426B0114UL))
#define bFM_DS_WIFSR_WUI4                         *((volatile  uint8_t *)(0x426B0118UL))
#define bFM0P_DS_WIFSR_WUI4                       *((volatile  uint8_t *)(0x426B0118UL))
#define bFM_DS_WIFSR_WUI5                         *((volatile  uint8_t *)(0x426B011CUL))
#define bFM0P_DS_WIFSR_WUI5                       *((volatile  uint8_t *)(0x426B011CUL))
#define bFM_DS_WIFSR_WCEC0I                       *((volatile  uint8_t *)(0x426B0120UL))
#define bFM0P_DS_WIFSR_WCEC0I                     *((volatile  uint8_t *)(0x426B0120UL))
#define bFM_DS_WIFSR_WCEC1I                       *((volatile  uint8_t *)(0x426B0124UL))
#define bFM0P_DS_WIFSR_WCEC1I                     *((volatile  uint8_t *)(0x426B0124UL))
#define bFM_DS_WIFSR_WUI6                         *((volatile  uint8_t *)(0x426B0128UL))
#define bFM0P_DS_WIFSR_WUI6                       *((volatile  uint8_t *)(0x426B0128UL))
#define bFM_DS_WIFSR_WUI7                         *((volatile  uint8_t *)(0x426B012CUL))
#define bFM0P_DS_WIFSR_WUI7                       *((volatile  uint8_t *)(0x426B012CUL))
#define bFM_DS_WIFSR_WUI8                         *((volatile  uint8_t *)(0x426B0130UL))
#define bFM0P_DS_WIFSR_WUI8                       *((volatile  uint8_t *)(0x426B0130UL))
#define bFM_DS_WIFSR_WUI9                         *((volatile  uint8_t *)(0x426B0134UL))
#define bFM0P_DS_WIFSR_WUI9                       *((volatile  uint8_t *)(0x426B0134UL))
#define bFM_DS_WIFSR_WUI10                        *((volatile  uint8_t *)(0x426B0138UL))
#define bFM0P_DS_WIFSR_WUI10                      *((volatile  uint8_t *)(0x426B0138UL))
#define bFM_DS_WIFSR_WUI11                        *((volatile  uint8_t *)(0x426B013CUL))
#define bFM0P_DS_WIFSR_WUI11                      *((volatile  uint8_t *)(0x426B013CUL))

#define bFM_DS_WILVR_WUI1LV                       *((volatile  uint8_t *)(0x426B0200UL))
#define bFM0P_DS_WILVR_WUI1LV                     *((volatile  uint8_t *)(0x426B0200UL))
#define bFM_DS_WILVR_WUI2LV                       *((volatile  uint8_t *)(0x426B0204UL))
#define bFM0P_DS_WILVR_WUI2LV                     *((volatile  uint8_t *)(0x426B0204UL))
#define bFM_DS_WILVR_WUI3LV                       *((volatile  uint8_t *)(0x426B0208UL))
#define bFM0P_DS_WILVR_WUI3LV                     *((volatile  uint8_t *)(0x426B0208UL))
#define bFM_DS_WILVR_WUI4LV                       *((volatile  uint8_t *)(0x426B020CUL))
#define bFM0P_DS_WILVR_WUI4LV                     *((volatile  uint8_t *)(0x426B020CUL))
#define bFM_DS_WILVR_WUI5LV                       *((volatile  uint8_t *)(0x426B0210UL))
#define bFM0P_DS_WILVR_WUI5LV                     *((volatile  uint8_t *)(0x426B0210UL))
#define bFM_DS_WILVR_WUI6LV                       *((volatile  uint8_t *)(0x426B0214UL))
#define bFM0P_DS_WILVR_WUI6LV                     *((volatile  uint8_t *)(0x426B0214UL))
#define bFM_DS_WILVR_WUI7LV                       *((volatile  uint8_t *)(0x426B0218UL))
#define bFM0P_DS_WILVR_WUI7LV                     *((volatile  uint8_t *)(0x426B0218UL))
#define bFM_DS_WILVR_WUI8LV                       *((volatile  uint8_t *)(0x426B021CUL))
#define bFM0P_DS_WILVR_WUI8LV                     *((volatile  uint8_t *)(0x426B021CUL))
#define bFM_DS_WILVR_WUI9LV                       *((volatile  uint8_t *)(0x426B0220UL))
#define bFM0P_DS_WILVR_WUI9LV                     *((volatile  uint8_t *)(0x426B0220UL))
#define bFM_DS_WILVR_WUI10LV                      *((volatile  uint8_t *)(0x426B0224UL))
#define bFM0P_DS_WILVR_WUI10LV                    *((volatile  uint8_t *)(0x426B0224UL))
#define bFM_DS_WILVR_WUI11LV                      *((volatile  uint8_t *)(0x426B0228UL))
#define bFM0P_DS_WILVR_WUI11LV                    *((volatile  uint8_t *)(0x426B0228UL))

