MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31D0AGN20000/mcu.h
#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42664400UL))
#define bFM0P_GPIO_DDR8_P0                        *((volatile  uint8_t *)(0x42664400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42664404UL))
#define bFM0P_GPIO_DDR8_P1                        *((volatile  uint8_t *)(0x42664404UL))

#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42664708UL))
#define bFM0P_GPIO_DDRE_P2                        *((volatile  uint8_t *)(0x42664708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x4266470CUL))
#define bFM0P_GPIO_DDRE_P3                        *((volatile  uint8_t *)(0x4266470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x4266C000UL))
#define bFM0P_GPIO_EPFR00_NMIS                    *((volatile  uint8_t *)(0x4266C000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x4266C024UL))
#define bFM0P_GPIO_EPFR00_USBP0E                  *((volatile  uint8_t *)(0x4266C024UL))
#define bFM_GPIO_EPFR00_SWDEN                     *((volatile  uint8_t *)(0x4266C040UL))
#define bFM0P_GPIO_EPFR00_SWDEN                   *((volatile  uint8_t *)(0x4266C040UL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM0P_GPIO_EPFR01_DTTI0C                  *((volatile  uint8_t *)(0x4266C0B0UL))
#define bFM_GPIO_EPFR01_IGTRG0                    *((volatile  uint8_t *)(0x4266C0B4UL))
#define bFM0P_GPIO_EPFR01_IGTRG0                  *((volatile  uint8_t *)(0x4266C0B4UL))

#define bFM_GPIO_FPOER0_P0                        *((volatile  uint8_t *)(0x42672000UL))
#define bFM0P_GPIO_FPOER0_P0                      *((volatile  uint8_t *)(0x42672000UL))
#define bFM_GPIO_FPOER0_P1                        *((volatile  uint8_t *)(0x42672004UL))
#define bFM0P_GPIO_FPOER0_P1                      *((volatile  uint8_t *)(0x42672004UL))
#define bFM_GPIO_FPOER0_P2                        *((volatile  uint8_t *)(0x42672008UL))
#define bFM0P_GPIO_FPOER0_P2                      *((volatile  uint8_t *)(0x42672008UL))
#define bFM_GPIO_FPOER0_P3                        *((volatile  uint8_t *)(0x4267200CUL))
#define bFM0P_GPIO_FPOER0_P3                      *((volatile  uint8_t *)(0x4267200CUL))
#define bFM_GPIO_FPOER0_P5                        *((volatile  uint8_t *)(0x42672014UL))
#define bFM0P_GPIO_FPOER0_P5                      *((volatile  uint8_t *)(0x42672014UL))
#define bFM_GPIO_FPOER0_PB                        *((volatile  uint8_t *)(0x4267202CUL))
#define bFM0P_GPIO_FPOER0_PB                      *((volatile  uint8_t *)(0x4267202CUL))
#define bFM_GPIO_FPOER0_PC                        *((volatile  uint8_t *)(0x42672030UL))
#define bFM0P_GPIO_FPOER0_PC                      *((volatile  uint8_t *)(0x42672030UL))
#define bFM_GPIO_FPOER0_PF                        *((volatile  uint8_t *)(0x4267203CUL))
#define bFM0P_GPIO_FPOER0_PF                      *((volatile  uint8_t *)(0x4267203CUL))

#define bFM_GPIO_FPOER1_P0                        *((volatile  uint8_t *)(0x42672080UL))
#define bFM0P_GPIO_FPOER1_P0                      *((volatile  uint8_t *)(0x42672080UL))
#define bFM_GPIO_FPOER1_P1                        *((volatile  uint8_t *)(0x42672084UL))
#define bFM0P_GPIO_FPOER1_P1                      *((volatile  uint8_t *)(0x42672084UL))
#define bFM_GPIO_FPOER1_P2                        *((volatile  uint8_t *)(0x42672088UL))
#define bFM0P_GPIO_FPOER1_P2                      *((volatile  uint8_t *)(0x42672088UL))
#define bFM_GPIO_FPOER1_P3                        *((volatile  uint8_t *)(0x4267208CUL))
#define bFM0P_GPIO_FPOER1_P3                      *((volatile  uint8_t *)(0x4267208CUL))
#define bFM_GPIO_FPOER1_P4                        *((volatile  uint8_t *)(0x42672090UL))
#define bFM0P_GPIO_FPOER1_P4                      *((volatile  uint8_t *)(0x42672090UL))
#define bFM_GPIO_FPOER1_P5                        *((volatile  uint8_t *)(0x42672094UL))
#define bFM0P_GPIO_FPOER1_P5                      *((volatile  uint8_t *)(0x42672094UL))
#define bFM_GPIO_FPOER1_PA                        *((volatile  uint8_t *)(0x426720A8UL))
#define bFM0P_GPIO_FPOER1_PA                      *((volatile  uint8_t *)(0x426720A8UL))
#define bFM_GPIO_FPOER1_PB                        *((volatile  uint8_t *)(0x426720ACUL))
#define bFM0P_GPIO_FPOER1_PB                      *((volatile  uint8_t *)(0x426720ACUL))
#define bFM_GPIO_FPOER1_PC                        *((volatile  uint8_t *)(0x426720B0UL))
#define bFM0P_GPIO_FPOER1_PC                      *((volatile  uint8_t *)(0x426720B0UL))
#define bFM_GPIO_FPOER1_PD                        *((volatile  uint8_t *)(0x426720B4UL))
#define bFM0P_GPIO_FPOER1_PD                      *((volatile  uint8_t *)(0x426720B4UL))
#define bFM_GPIO_FPOER1_PE                        *((volatile  uint8_t *)(0x426720B8UL))
#define bFM0P_GPIO_FPOER1_PE                      *((volatile  uint8_t *)(0x426720B8UL))
#define bFM_GPIO_FPOER1_PF                        *((volatile  uint8_t *)(0x426720BCUL))
#define bFM0P_GPIO_FPOER1_PF                      *((volatile  uint8_t *)(0x426720BCUL))

#define bFM_GPIO_FPOER2_P1                        *((volatile  uint8_t *)(0x42672104UL))
#define bFM0P_GPIO_FPOER2_P1                      *((volatile  uint8_t *)(0x42672104UL))
#define bFM_GPIO_FPOER2_P2                        *((volatile  uint8_t *)(0x42672108UL))
#define bFM0P_GPIO_FPOER2_P2                      *((volatile  uint8_t *)(0x42672108UL))
#define bFM_GPIO_FPOER2_P3                        *((volatile  uint8_t *)(0x4267210CUL))
#define bFM0P_GPIO_FPOER2_P3                      *((volatile  uint8_t *)(0x4267210CUL))

#define bFM_GPIO_FPOER3_P0                        *((volatile  uint8_t *)(0x42672180UL))
#define bFM0P_GPIO_FPOER3_P0                      *((volatile  uint8_t *)(0x42672180UL))
#define bFM_GPIO_FPOER3_P1                        *((volatile  uint8_t *)(0x42672184UL))
#define bFM0P_GPIO_FPOER3_P1                      *((volatile  uint8_t *)(0x42672184UL))
#define bFM_GPIO_FPOER3_P2                        *((volatile  uint8_t *)(0x42672188UL))
#define bFM0P_GPIO_FPOER3_P2                      *((volatile  uint8_t *)(0x42672188UL))
#define bFM_GPIO_FPOER3_P3                        *((volatile  uint8_t *)(0x4267218CUL))
#define bFM0P_GPIO_FPOER3_P3                      *((volatile  uint8_t *)(0x4267218CUL))
#define bFM_GPIO_FPOER3_P4                        *((volatile  uint8_t *)(0x42672190UL))
#define bFM0P_GPIO_FPOER3_P4                      *((volatile  uint8_t *)(0x42672190UL))
#define bFM_GPIO_FPOER3_P5                        *((volatile  uint8_t *)(0x42672194UL))
#define bFM0P_GPIO_FPOER3_P5                      *((volatile  uint8_t *)(0x42672194UL))
#define bFM_GPIO_FPOER3_PA                        *((volatile  uint8_t *)(0x426721A8UL))
#define bFM0P_GPIO_FPOER3_PA                      *((volatile  uint8_t *)(0x426721A8UL))
#define bFM_GPIO_FPOER3_PB                        *((volatile  uint8_t *)(0x426721ACUL))
#define bFM0P_GPIO_FPOER3_PB                      *((volatile  uint8_t *)(0x426721ACUL))
#define bFM_GPIO_FPOER3_PC                        *((volatile  uint8_t *)(0x426721B0UL))
#define bFM0P_GPIO_FPOER3_PC                      *((volatile  uint8_t *)(0x426721B0UL))
#define bFM_GPIO_FPOER3_PD                        *((volatile  uint8_t *)(0x426721B4UL))
#define bFM0P_GPIO_FPOER3_PD                      *((volatile  uint8_t *)(0x426721B4UL))
#define bFM_GPIO_FPOER3_PE                        *((volatile  uint8_t *)(0x426721B8UL))
#define bFM0P_GPIO_FPOER3_PE                      *((volatile  uint8_t *)(0x426721B8UL))
#define bFM_GPIO_FPOER3_PF                        *((volatile  uint8_t *)(0x426721BCUL))
#define bFM0P_GPIO_FPOER3_PF                      *((volatile  uint8_t *)(0x426721BCUL))

#define bFM_GPIO_FPOER4_P0                        *((volatile  uint8_t *)(0x42672200UL))
#define bFM0P_GPIO_FPOER4_P0                      *((volatile  uint8_t *)(0x42672200UL))
#define bFM_GPIO_FPOER4_P1                        *((volatile  uint8_t *)(0x42672204UL))
#define bFM0P_GPIO_FPOER4_P1                      *((volatile  uint8_t *)(0x42672204UL))
#define bFM_GPIO_FPOER4_P2                        *((volatile  uint8_t *)(0x42672208UL))
#define bFM0P_GPIO_FPOER4_P2                      *((volatile  uint8_t *)(0x42672208UL))
#define bFM_GPIO_FPOER4_P3                        *((volatile  uint8_t *)(0x4267220CUL))
#define bFM0P_GPIO_FPOER4_P3                      *((volatile  uint8_t *)(0x4267220CUL))
#define bFM_GPIO_FPOER4_P6                        *((volatile  uint8_t *)(0x42672218UL))
#define bFM0P_GPIO_FPOER4_P6                      *((volatile  uint8_t *)(0x42672218UL))
#define bFM_GPIO_FPOER4_P7                        *((volatile  uint8_t *)(0x4267221CUL))
#define bFM0P_GPIO_FPOER4_P7                      *((volatile  uint8_t *)(0x4267221CUL))
#define bFM_GPIO_FPOER4_PC                        *((volatile  uint8_t *)(0x42672230UL))
#define bFM0P_GPIO_FPOER4_PC                      *((volatile  uint8_t *)(0x42672230UL))
#define bFM_GPIO_FPOER4_PD                        *((volatile  uint8_t *)(0x42672234UL))
#define bFM0P_GPIO_FPOER4_PD                      *((volatile  uint8_t *)(0x42672234UL))
#define bFM_GPIO_FPOER4_PE                        *((volatile  uint8_t *)(0x42672238UL))
#define bFM0P_GPIO_FPOER4_PE                      *((volatile  uint8_t *)(0x42672238UL))

#define bFM_GPIO_FPOER5_P0                        *((volatile  uint8_t *)(0x42672280UL))
#define bFM0P_GPIO_FPOER5_P0                      *((volatile  uint8_t *)(0x42672280UL))
#define bFM_GPIO_FPOER5_P1                        *((volatile  uint8_t *)(0x42672284UL))
#define bFM0P_GPIO_FPOER5_P1                      *((volatile  uint8_t *)(0x42672284UL))
#define bFM_GPIO_FPOER5_P2                        *((volatile  uint8_t *)(0x42672288UL))
#define bFM0P_GPIO_FPOER5_P2                      *((volatile  uint8_t *)(0x42672288UL))
#define bFM_GPIO_FPOER5_P3                        *((volatile  uint8_t *)(0x4267228CUL))
#define bFM0P_GPIO_FPOER5_P3                      *((volatile  uint8_t *)(0x4267228CUL))

#define bFM_GPIO_FPOER6_P0                        *((volatile  uint8_t *)(0x42672300UL))
#define bFM0P_GPIO_FPOER6_P0                      *((volatile  uint8_t *)(0x42672300UL))
#define bFM_GPIO_FPOER6_P1                        *((volatile  uint8_t *)(0x42672304UL))
#define bFM0P_GPIO_FPOER6_P1                      *((volatile  uint8_t *)(0x42672304UL))

#define bFM_GPIO_FPOER8_P0                        *((volatile  uint8_t *)(0x42672400UL))
#define bFM0P_GPIO_FPOER8_P0                      *((volatile  uint8_t *)(0x42672400UL))
#define bFM_GPIO_FPOER8_P1                        *((volatile  uint8_t *)(0x42672404UL))
#define bFM0P_GPIO_FPOER8_P1                      *((volatile  uint8_t *)(0x42672404UL))

#define bFM_GPIO_FPOERE_P2                        *((volatile  uint8_t *)(0x42672708UL))
#define bFM0P_GPIO_FPOERE_P2                      *((volatile  uint8_t *)(0x42672708UL))
#define bFM_GPIO_FPOERE_P3                        *((volatile  uint8_t *)(0x4267270CUL))
#define bFM0P_GPIO_FPOERE_P3                      *((volatile  uint8_t *)(0x4267270CUL))

#define bFM_GPIO_LVDIE_LVDIE                      *((volatile  uint8_t *)(0x4266E800UL))
#define bFM0P_GPIO_LVDIE_LVDIE                    *((volatile  uint8_t *)(0x4266E800UL))

#define bFM_GPIO_PCR0_P0                          *((volatile  uint8_t *)(0x42662000UL))
#define bFM0P_GPIO_PCR0_P0                        *((volatile  uint8_t *)(0x42662000UL))
#define bFM_GPIO_PCR0_P1                          *((volatile  uint8_t *)(0x42662004UL))
#define bFM0P_GPIO_PCR0_P1                        *((volatile  uint8_t *)(0x42662004UL))
#define bFM_GPIO_PCR0_P2                          *((volatile  uint8_t *)(0x42662008UL))
#define bFM0P_GPIO_PCR0_P2                        *((volatile  uint8_t *)(0x42662008UL))
#define bFM_GPIO_PCR0_P3                          *((volatile  uint8_t *)(0x4266200CUL))
#define bFM0P_GPIO_PCR0_P3                        *((volatile  uint8_t *)(0x4266200CUL))
#define bFM_GPIO_PCR0_P5                          *((volatile  uint8_t *)(0x42662014UL))
#define bFM0P_GPIO_PCR0_P5                        *((volatile  uint8_t *)(0x42662014UL))
#define bFM_GPIO_PCR0_PB                          *((volatile  uint8_t *)(0x4266202CUL))
#define bFM0P_GPIO_PCR0_PB                        *((volatile  uint8_t *)(0x4266202CUL))
#define bFM_GPIO_PCR0_PC                          *((volatile  uint8_t *)(0x42662030UL))
#define bFM0P_GPIO_PCR0_PC                        *((volatile  uint8_t *)(0x42662030UL))
#define bFM_GPIO_PCR0_PF                          *((volatile  uint8_t *)(0x4266203CUL))
#define bFM0P_GPIO_PCR0_PF                        *((volatile  uint8_t *)(0x4266203CUL))

#define bFM_GPIO_PCR1_P0                          *((volatile  uint8_t *)(0x42662080UL))
#define bFM0P_GPIO_PCR1_P0                        *((volatile  uint8_t *)(0x42662080UL))
#define bFM_GPIO_PCR1_P1                          *((volatile  uint8_t *)(0x42662084UL))
#define bFM0P_GPIO_PCR1_P1                        *((volatile  uint8_t *)(0x42662084UL))
#define bFM_GPIO_PCR1_P2                          *((volatile  uint8_t *)(0x42662088UL))
#define bFM0P_GPIO_PCR1_P2                        *((volatile  uint8_t *)(0x42662088UL))
#define bFM_GPIO_PCR1_P3                          *((volatile  uint8_t *)(0x4266208CUL))
#define bFM0P_GPIO_PCR1_P3                        *((volatile  uint8_t *)(0x4266208CUL))
#define bFM_GPIO_PCR1_P4                          *((volatile  uint8_t *)(0x42662090UL))
#define bFM0P_GPIO_PCR1_P4                        *((volatile  uint8_t *)(0x42662090UL))
#define bFM_GPIO_PCR1_P5                          *((volatile  uint8_t *)(0x42662094UL))
#define bFM0P_GPIO_PCR1_P5                        *((volatile  uint8_t *)(0x42662094UL))
#define bFM_GPIO_PCR1_PA                          *((volatile  uint8_t *)(0x426620A8UL))
#define bFM0P_GPIO_PCR1_PA                        *((volatile  uint8_t *)(0x426620A8UL))
#define bFM_GPIO_PCR1_PB                          *((volatile  uint8_t *)(0x426620ACUL))
#define bFM0P_GPIO_PCR1_PB                        *((volatile  uint8_t *)(0x426620ACUL))
#define bFM_GPIO_PCR1_PC                          *((volatile  uint8_t *)(0x426620B0UL))
#define bFM0P_GPIO_PCR1_PC                        *((volatile  uint8_t *)(0x426620B0UL))
#define bFM_GPIO_PCR1_PD                          *((volatile  uint8_t *)(0x426620B4UL))
#define bFM0P_GPIO_PCR1_PD                        *((volatile  uint8_t *)(0x426620B4UL))
#define bFM_GPIO_PCR1_PE                          *((volatile  uint8_t *)(0x426620B8UL))
#define bFM0P_GPIO_PCR1_PE                        *((volatile  uint8_t *)(0x426620B8UL))
#define bFM_GPIO_PCR1_PF                          *((volatile  uint8_t *)(0x426620BCUL))
#define bFM0P_GPIO_PCR1_PF                        *((volatile  uint8_t *)(0x426620BCUL))

