MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31D0AGN20000/mcu.h
#define bFM_MFSI2S0_I2SST_CKSTP                   *((volatile  uint8_t *)(0x42794120UL))
#define bFM0P_MFSI2S0_I2SST_CKSTP                 *((volatile  uint8_t *)(0x42794120UL))
#define bFM_MFSI2S0_I2SST_BUSY                    *((volatile  uint8_t *)(0x42794124UL))
#define bFM0P_MFSI2S0_I2SST_BUSY                  *((volatile  uint8_t *)(0x42794124UL))


/*******************************************************************************
* MFSI2S Registers MFSI2S1
*   Bitband Section
*******************************************************************************/
#define bFM_MFSI2S1_CNTLREG_FRAML                 *((volatile  uint16_t*)(0x42795000UL))
#define bFM0P_MFSI2S1_CNTLREG_FRAML               *((volatile  uint16_t*)(0x42795000UL))
#define bFM_MFSI2S1_CNTLREG_I2SMOD                *((volatile  uint16_t*)(0x4279500CUL))
#define bFM0P_MFSI2S1_CNTLREG_I2SMOD              *((volatile  uint16_t*)(0x4279500CUL))
#define bFM_MFSI2S1_CNTLREG_FSPL                  *((volatile  uint16_t*)(0x42795010UL))
#define bFM0P_MFSI2S1_CNTLREG_FSPL                *((volatile  uint16_t*)(0x42795010UL))
#define bFM_MFSI2S1_CNTLREG_I2SEN                 *((volatile  uint16_t*)(0x42795014UL))
#define bFM0P_MFSI2S1_CNTLREG_I2SEN               *((volatile  uint16_t*)(0x42795014UL))
#define bFM_MFSI2S1_CNTLREG_CKOE                  *((volatile  uint16_t*)(0x42795018UL))
#define bFM0P_MFSI2S1_CNTLREG_CKOE                *((volatile  uint16_t*)(0x42795018UL))
#define bFM_MFSI2S1_CNTLREG_MSKB                  *((volatile  uint16_t*)(0x42795020UL))
#define bFM0P_MFSI2S1_CNTLREG_MSKB                *((volatile  uint16_t*)(0x42795020UL))
#define bFM_MFSI2S1_CNTLREG_I2SRUN                *((volatile  uint16_t*)(0x42795028UL))
#define bFM0P_MFSI2S1_CNTLREG_I2SRUN              *((volatile  uint16_t*)(0x42795028UL))

#define bFM_MFSI2S1_I2SCLK_MCKOE                  *((volatile  uint16_t*)(0x427950B8UL))
#define bFM0P_MFSI2S1_I2SCLK_MCKOE                *((volatile  uint16_t*)(0x427950B8UL))
#define bFM_MFSI2S1_I2SCLK_MCKIE                  *((volatile  uint16_t*)(0x427950BCUL))
#define bFM0P_MFSI2S1_I2SCLK_MCKIE                *((volatile  uint16_t*)(0x427950BCUL))

#define bFM_MFSI2S1_I2SST_CKSTP                   *((volatile  uint8_t *)(0x42795120UL))
#define bFM0P_MFSI2S1_I2SST_CKSTP                 *((volatile  uint8_t *)(0x42795120UL))
#define bFM_MFSI2S1_I2SST_BUSY                    *((volatile  uint8_t *)(0x42795124UL))
#define bFM0P_MFSI2S1_I2SST_BUSY                  *((volatile  uint8_t *)(0x42795124UL))


/*******************************************************************************
* MTB_DWT Registers MTB_DWT
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* RTC Registers RTC
*   Bitband Section
*******************************************************************************/
#define bFM_RTC_ALMOR_TAMO0                       *((volatile  uint8_t *)(0x42760330UL))
#define bFM0P_RTC_ALMOR_TAMO0                     *((volatile  uint8_t *)(0x42760330UL))

#define bFM_RTC_WTCALEN_WTCALEN                   *((volatile  uint8_t *)(0x427604C0UL))
#define bFM0P_RTC_WTCALEN_WTCALEN                 *((volatile  uint8_t *)(0x427604C0UL))

#define bFM_RTC_WTCLKS_WTCLKS                     *((volatile  uint8_t *)(0x42760400UL))
#define bFM0P_RTC_WTCLKS_WTCLKS                   *((volatile  uint8_t *)(0x42760400UL))

#define bFM_RTC_WTCOSEL_WTCOSEL                   *((volatile  uint8_t *)(0x42760600UL))
#define bFM0P_RTC_WTCOSEL_WTCOSEL                 *((volatile  uint8_t *)(0x42760600UL))

#define bFM_RTC_WTCR1_ST                          *((volatile  uint8_t *)(0x42760000UL))
#define bFM0P_RTC_WTCR1_ST                        *((volatile  uint8_t *)(0x42760000UL))
#define bFM_RTC_WTCR1_RUN                         *((volatile  uint8_t *)(0x42760008UL))
#define bFM0P_RTC_WTCR1_RUN                       *((volatile  uint8_t *)(0x42760008UL))
#define bFM_RTC_WTCR1_SRST                        *((volatile  uint8_t *)(0x4276000CUL))
#define bFM0P_RTC_WTCR1_SRST                      *((volatile  uint8_t *)(0x4276000CUL))
#define bFM_RTC_WTCR1_SCST                        *((volatile  uint8_t *)(0x42760010UL))
#define bFM0P_RTC_WTCR1_SCST                      *((volatile  uint8_t *)(0x42760010UL))
#define bFM_RTC_WTCR1_SCRST                       *((volatile  uint8_t *)(0x42760014UL))
#define bFM0P_RTC_WTCR1_SCRST                     *((volatile  uint8_t *)(0x42760014UL))
#define bFM_RTC_WTCR1_BUSY                        *((volatile  uint8_t *)(0x42760018UL))
#define bFM0P_RTC_WTCR1_BUSY                      *((volatile  uint8_t *)(0x42760018UL))
#define bFM_RTC_WTCR1_MIEN                        *((volatile  uint8_t *)(0x42760020UL))
#define bFM0P_RTC_WTCR1_MIEN                      *((volatile  uint8_t *)(0x42760020UL))
#define bFM_RTC_WTCR1_HEN                         *((volatile  uint8_t *)(0x42760024UL))
#define bFM0P_RTC_WTCR1_HEN                       *((volatile  uint8_t *)(0x42760024UL))
#define bFM_RTC_WTCR1_DEN                         *((volatile  uint8_t *)(0x42760028UL))
#define bFM0P_RTC_WTCR1_DEN                       *((volatile  uint8_t *)(0x42760028UL))
#define bFM_RTC_WTCR1_MOEN                        *((volatile  uint8_t *)(0x4276002CUL))
#define bFM0P_RTC_WTCR1_MOEN                      *((volatile  uint8_t *)(0x4276002CUL))
#define bFM_RTC_WTCR1_YEN                         *((volatile  uint8_t *)(0x42760030UL))
#define bFM0P_RTC_WTCR1_YEN                       *((volatile  uint8_t *)(0x42760030UL))
#define bFM_RTC_WTCR1_INTSSI                      *((volatile  uint8_t *)(0x42760040UL))
#define bFM0P_RTC_WTCR1_INTSSI                    *((volatile  uint8_t *)(0x42760040UL))
#define bFM_RTC_WTCR1_INTSI                       *((volatile  uint8_t *)(0x42760044UL))
#define bFM0P_RTC_WTCR1_INTSI                     *((volatile  uint8_t *)(0x42760044UL))
#define bFM_RTC_WTCR1_INTMI                       *((volatile  uint8_t *)(0x42760048UL))
#define bFM0P_RTC_WTCR1_INTMI                     *((volatile  uint8_t *)(0x42760048UL))
#define bFM_RTC_WTCR1_INTHI                       *((volatile  uint8_t *)(0x4276004CUL))
#define bFM0P_RTC_WTCR1_INTHI                     *((volatile  uint8_t *)(0x4276004CUL))
#define bFM_RTC_WTCR1_INTTMI                      *((volatile  uint8_t *)(0x42760050UL))
#define bFM0P_RTC_WTCR1_INTTMI                    *((volatile  uint8_t *)(0x42760050UL))
#define bFM_RTC_WTCR1_INTALI                      *((volatile  uint8_t *)(0x42760054UL))
#define bFM0P_RTC_WTCR1_INTALI                    *((volatile  uint8_t *)(0x42760054UL))
#define bFM_RTC_WTCR1_INTERI                      *((volatile  uint8_t *)(0x42760058UL))
#define bFM0P_RTC_WTCR1_INTERI                    *((volatile  uint8_t *)(0x42760058UL))
#define bFM_RTC_WTCR1_INTCRI                      *((volatile  uint8_t *)(0x4276005CUL))
#define bFM0P_RTC_WTCR1_INTCRI                    *((volatile  uint8_t *)(0x4276005CUL))
#define bFM_RTC_WTCR1_INTSSIE                     *((volatile  uint8_t *)(0x42760060UL))
#define bFM0P_RTC_WTCR1_INTSSIE                   *((volatile  uint8_t *)(0x42760060UL))
#define bFM_RTC_WTCR1_INTSIE                      *((volatile  uint8_t *)(0x42760064UL))
#define bFM0P_RTC_WTCR1_INTSIE                    *((volatile  uint8_t *)(0x42760064UL))
#define bFM_RTC_WTCR1_INTMIE                      *((volatile  uint8_t *)(0x42760068UL))
#define bFM0P_RTC_WTCR1_INTMIE                    *((volatile  uint8_t *)(0x42760068UL))
#define bFM_RTC_WTCR1_INTHIE                      *((volatile  uint8_t *)(0x4276006CUL))
#define bFM0P_RTC_WTCR1_INTHIE                    *((volatile  uint8_t *)(0x4276006CUL))
#define bFM_RTC_WTCR1_INTTMIE                     *((volatile  uint8_t *)(0x42760070UL))
#define bFM0P_RTC_WTCR1_INTTMIE                   *((volatile  uint8_t *)(0x42760070UL))
#define bFM_RTC_WTCR1_INTALIE                     *((volatile  uint8_t *)(0x42760074UL))
#define bFM0P_RTC_WTCR1_INTALIE                   *((volatile  uint8_t *)(0x42760074UL))
#define bFM_RTC_WTCR1_INTERIE                     *((volatile  uint8_t *)(0x42760078UL))
#define bFM0P_RTC_WTCR1_INTERIE                   *((volatile  uint8_t *)(0x42760078UL))
#define bFM_RTC_WTCR1_INTCRIE                     *((volatile  uint8_t *)(0x4276007CUL))
#define bFM0P_RTC_WTCR1_INTCRIE                   *((volatile  uint8_t *)(0x4276007CUL))

#define bFM_RTC_WTCR2_CREAD                       *((volatile  uint8_t *)(0x42760080UL))
#define bFM0P_RTC_WTCR2_CREAD                     *((volatile  uint8_t *)(0x42760080UL))
#define bFM_RTC_WTCR2_TMST                        *((volatile  uint8_t *)(0x427600A0UL))
#define bFM0P_RTC_WTCR2_TMST                      *((volatile  uint8_t *)(0x427600A0UL))
#define bFM_RTC_WTCR2_TMEN                        *((volatile  uint8_t *)(0x427600A4UL))
#define bFM0P_RTC_WTCR2_TMEN                      *((volatile  uint8_t *)(0x427600A4UL))
#define bFM_RTC_WTCR2_TMRUN                       *((volatile  uint8_t *)(0x427600A8UL))
#define bFM0P_RTC_WTCR2_TMRUN                     *((volatile  uint8_t *)(0x427600A8UL))

